; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem strips-gripper-x-1)
   (:domain gripper-strips)
   (:objects R1 R2 B4 B3 B2 B1 left right)
   (:init (room R1)
          (room R2)
          (ball B4)
          (ball B3)
          (ball B2)
          (ball B1)
          (at-robby R1)
          (free left)
          (free right)
          (at B4 R1)
          (at B3 R1)
          (at B2 R1)
          (at B1 R1)
          (gripper left)
          (gripper right))
   (:goal (and (at B4 R2)
               (at B3 R2)
               (at B2 R2)
               (at B1 R2))))

; plan
1. (pick b1 r1 right)
   deleted: (at b1 r1) (free right)
   added: (carry b1 right)
   goals met: 0 of 4
2. (move r1 r2)
   deleted: (at-robby r1)
   added: (at-robby r2)
   goals met: 0 of 4
3. (drop b1 r2 right)
   deleted: (carry b1 right)
   added: (at b1 r2) (free right)
   goals met: 1 of 4
4. (move r2 r1)
   deleted: (at-robby r2)
   added: (at-robby r1)
   goals met: 1 of 4
5. (pick b2 r1 right)
   deleted: (at b2 r1) (free right)
   added: (carry b2 right)
   goals met: 1 of 4
6. (move r1 r2)
   deleted: (at-robby r1)
   added: (at-robby r2)
   goals met: 1 of 4
7. (drop b2 r2 right)
   deleted: (carry b2 right)
   added: (at b2 r2) (free right)
   goals met: 2 of 4
8. (move r2 r1)
   deleted: (at-robby r2)
   added: (at-robby r1)
   goals met: 2 of 4
9. (pick b3 r1 right)
   deleted: (at b3 r1) (free right)
   added: (carry b3 right)
   goals met: 2 of 4
10. (move r1 r2)
   deleted: (at-robby r1)
   added: (at-robby r2)
   goals met: 2 of 4
11. (drop b3 r2 right)
   deleted: (carry b3 right)
   added: (at b3 r2) (free right)
   goals met: 3 of 4
12. (move r2 r1)
   deleted: (at-robby r2)
   added: (at-robby r1)
   goals met: 3 of 4
13. (pick b4 r1 right)
   deleted: (at b4 r1) (free right)
   added: (carry b4 right)
   goals met: 3 of 4
14. (move r1 r2)
   deleted: (at-robby r1)
   added: (at-robby r2)
   goals met: 3 of 4
15. (drop b4 r2 right)
   deleted: (carry b4 right)
   added: (at b4 r2) (free right)
   goals met: 4 of 4
